interface questions {
    idq?: number;
    str?: string;
    values?: string[];
}

interface DataTableInterface {
    id?: number;
    title?: string;
    'questions'?: questions[];
}

const DataTableValues: DataTableInterface[] = [
    {
        'id': 1,
        'title': 'اطلاعات مدیریتی',
        'questions': [
            {
                idq: 1,
                str: 'چه کسی اطلاعات را ثبت می کند',
                'values': [
                    'پزشک ',
                    'فیزیوتراپ',
                    'مربی',
                    'اسیب شناس ورزشی'
                ]
            },
            {
                idq: 2,
                str: 'منبع  ثبت اسیب',
                'values': [
                    'بیمارستان - سرپایی (شامل بخش اورژانس و بیماران سرپایی) ',
                    'بیمارستان - سابقه بستری',
                    'سابقه کلینیک پزشکی ورزشی',
                    'سایر سوابق کلینیک سلامت (به عنوان مثال پزشک عمومی)',
                    'سوابق شرکت بیمه',
                    'سوابق خدمات پوشش پزشکی رویدادهای ورزشی',
                    'سوابق مدرسه',
                    'سوابق باشگاه یا سازمان ورزشی',
                    'سوابق امکانات ورزشی و/یا تفریحی',
                    'ثبت سوابق آموزش عالی',
                    'سوابق دیگر(مشخص کنید)',
                    'ناشناخته',
                    'تاریخ آسیب (روز/ماه/سال)',
                    'زمان آسیب(در 24 ساعت ساعت/دقیقه، صبح/عصر)',
                    'تاریخ ثبت آسیب',
                    'اطلاعات بیمه ورزشی',
                    'روز عادی یا تعطیل رسمی'
                ]
            }
        ]
    },
    {
        'id': 2,
        'title': 'داده های دموگرافیک',
        'questions': [
            {
                idq: 1,
                str: 'داده ها',
                'values': [
                    'شماره ثبت ',
                    'کد ملی',
                    'سن',
                    'قد',
                    'وزن',
                    'جنس',
                    'استان محل سکونت',
                    'شهر محل سکونت',
                    'سطح رقابت/تمرین(نخبه، آماتور، ورزشکاان تفریحی)،',
                    'نوع ناتوانی/نقص(پاراالمپیک)،',
                    'اطلاعات تماس(شماره تلفن، شماره تلفن جایگزین)،',
                    'وضعیت تاهل',
                    'تحصیلات',
                    'سال تحصیلی',
                    'ملیت',
                    'شهروند',
                    'اطلاعات پستی محل سکونت',
                    'شماره پرونده بیمارستانی',
                    'تاریخ تولد'
                ]
            },
        ]
    },
    {
        'id': 3,
        'title': 'مکان آسیب',
        'questions': [
            {
                idq: 1,
                str: 'نام مکان اسیب(متن)',
                'values': [
                    'نام مکان اسیب(متن)-',
                ]
            },
            {
                idq: 2,
                str: 'نام مکان اسیب (نوع)',
                'values': [
                    'خانه (شامل خانه مزرعه)',
                    'موسسه اقامتی (به استثنای بیمارستان)',
                    'مدرسه، شامل مرکز مراقبت روزانه از کودکان)',
                    'بیمارستان یا سایر خدمات بهداشتی',
                    'مراکز تفریحی / تناسب اندام (مکانی عمدتاً برای فعالیت های تفریحی غیررسمی)',
                    'مراکز ورزشی( رسمی)',
                    'خیابان یا بزرگراه (جاده عمومی)',
                    'مرکزتجاری یا خدماتی',
                    'منطقه صنعتی یا ساختمانی',
                    'معدن یا شکار',
                    'مزرعه (به استثنای خانه مزرعه)',
                    'سایر مکان های مشخص شده (شامل جنگل، ساحل، ساختمان متروکه)',
                    'مکان نامشخص'
                ]
            },
            {
                idq: 3,
                str: 'مکانهای ورزشی تفریحی معین(کورت)',
                'values': [
                    'تنیس',
                    'بسکتبال',
                    'نت بال',
                    'اسکواش',
                    'والیبال',
                    'کورت برای سایر ورزشها'
                ]
            },
            {
                idq: 4,
                str: 'زمین بازی(میدان)',
                values: [
                    'فوتبال استرالیا',
                    'فوتبال',
                    'لیگ راگبی',
                    'اتحادیه راگبی',
                    'کریکت',
                    'هاکی',
                    'بیس بال',
                    'سافت بال',
                    'میدان برای ورزش های دیگر'
                ]
            },
            {
                idq: 5,
                str: 'محل برگزاری دو و میدانی',
                values: null
            },
            {
                idq: 6,
                str: 'محل برگزاری ورزش رزمی',
                values: [
                    'محل برگزاری بوکس',
                    'سایر مکان های ورزشی رزمی'
                ]
            },
            {
                idq: 7,
                str: 'پیست مسابقه',
                values: [
                    'پیست دوچرخه سواری',
                    ' پیست موتورسواری',
                    'پیست اسب دوانی',
                    'سایر مسیر مسابقه',
                ]
            },
            {
                idq: 8,
                str: 'محدوده هدف',
                values: [
                    'تیراندازی (انواع سلاح گرم)',
                    'تیراندازی با کمان',
                    'محدوده هدف دیگر'
                ]
            },
            {
                idq: 9,
                str: 'سایر مکان های ورزشی تخصصی',
                values: [
                    'زمین گلف',
                    'محل برگزاری بولینگ',
                    'محل صعود',
                    'سایر مکان های ورزشی تخصصی'
                ]
            },
            {
                idq: 10,
                str: 'استخر شنا و مجموعه های ابی',
                values: null
            },
            {
                idq: 11,
                str: 'باشگاه یا مرکز تناسب اندام',
                values: null
            },
            {
                idq: 12,
                str: 'زمین ورزشی (چند منظوره یا نامشخص)',
                values: null
            },
            {
                idq: 13,
                str: 'ورزشگاه',
                values: null
            },
            {
                idq: 14,
                str: 'پیست روی یخ',
                values: null
            },
            {
                idq: 15,
                str: 'منطقه ورزشی برفی',
                values: null
            },
            {
                idq: 16,
                str: 'فضاهای اسکیت سواری',
                values: null
            },
            {
                idq: 17,
                str: 'محل رقص',
                values: null
            },
            {
                idq: 18,
                str: 'بیلیارد، محل برگزاری اسنوکر',
                values: null
            },
            {
                idq: 19,
                str: 'سایر امکانات ورزشی چند منظوره',
                values: null
            },
            {
                idq: 20,
                str: 'مکان دیگر',
                values: null
            },
            {
                idq: 21,
                str: 'مکان نامشخص',
                values: null
            },
            {
                idq: 22,
                str: 'مکان سرپوشیده یا بیرونی',
                values: [
                    'سرپوشیده',
                    'فضای باز',
                    'دیگر',
                    'ناشناخته'
                ]
            },
            {
                idq: 23,
                str: 'متعلق به، یا مدیریت شده توسط',
                values: [
                    'شورای محلی',
                    'دولت ایالتی',
                    'دولت فدرال',
                    'خصوصی',
                    'دیگر',
                    'ناشناخته'
                ]
            },
            {
                idq: 24,
                str: 'بخش خاصی از مکان اسیب(لوکیشن میدان در ورزش تیمی)',
                values: [
                    'در محدوده منطقه مشارکت/زمین بازی',
                    'اطراف، از جمله منطقه تماشاگران، پارکینگ، منطقه مقامات',
                    'جعبه دروازه تا خط وسط دفاع',
                    'جعبه دروازه تا خط وسط حمله',
                    'جعبه دروازه حمله',
                    'محوطه جریمه حمله',
                    'نیمه اول زمین',
                    'نیمه دوم زمین',
                    'کنار دروازه در حال دفاع',
                    'کنار دروازه در حال حمله',
                    'منطقه گرم کردن',
                    'رختکن، دوش',
                    'در حین حمل و نقل به رویداد یا فعالیت',
                    'خارج زمین',
                    'سایر',
                    'نامشخص'
                ]
            },
        ]
    },
    {
        id: 4,
        title: 'دسته بندی حالت شروع آسیب',
        questions: [
            {
                idq: 1,
                str: 'حاد',
                values: null
            },
            {
                idq: 2,
                str: 'تکراری و بطور ناگهانی',
                values: null
            },
            {
                idq: 3,
                str: 'تکراری وبطور تدریجی',
                values: null
            },
            {
                idq: 4,
                str: 'ترکیب حاد و مزمن',
                values: null
            },
        ]
    },
    {
        id: 5,
        title: 'دسته بندی مکانیسم اسیب',
        questions: [
            {
                idq: 1,
                str: 'برخورد مستقیم',
                values: null
            },
            {
                idq: 2,
                str: 'برخورد غیر مستقیم',
                values: null
            },
            {
                idq: 3,
                str: 'غیربرخوردی',
                values: null
            },
        ]
    },
    {
        id: 6,
        title: 'شدت اسیب',
        questions: [
            {
                idq: 1,
                str: 'بر اساس TIME LOSS',
                values: null
            },
            {
                idq: 2,
                str: 'کم: صفر روز',
                values: null
            },
            {
                idq: 3,
                str: 'خفیف: غیبت از تمرین یا مسابقه 1-3 روز',
                values: null
            },
            {
                idq: 4,
                str: 'ملایم: 4-7 روز',
                values: null
            },
            {
                idq: 5,
                str: 'متوسط: 8-28 روز',
                values: null
            },
            {
                idq: 6,
                str: 'شدید: بیشتر از 28 روز',
                values: null
            },
            {
                idq: 7,
                str: 'آسیب منجر به بازنشستگی فرد از ورزش',
                values: null
            },
            {
                idq: 8,
                str: 'اسیب مرگبار در تمرین یا مسابقه',
                values: null
            },
            {
                idq: 9,
                str: 'اسیب فاجعه بار',
                values: [
                    'اسیب مغزی در اثر تروما',
                    'اسیب ستون فقرات',
                    'اسیب غیر جسمی تهدیدکننده زندگی مثل ایست قلبی'
                ]
            },
            {
                idq: 10,
                str: 'از طریق سنجش فاکتورهای امادگی جسمانی مثل قدرت، تعادل',
                values: null
            },
            {
                idq: 11,
                str: 'استفاده از شاخص شدت ورزش SSI))',
                values: null
            },
            {
                idq: 12,
                str: 'با استفاده از مقیاس آسیب مختصرAIS))',
                values: null
            },
            {
                idq: 13,
                str: 'بر اساس نوع اسیب',
                values: [
                    'رگ به رگ شدن ها، کشیدگیها، کوفتگی ها و زخم ها به آسیب های خفیف',
                    'دررفتگی ها، شکستگی ها یا ضربه های مغزی آسیب های شدید'
                ]
            },
        ]
    },
    {
        id: 7,
        title: 'گزارش ورزشکار در معرض اسیب (نوع در معرض)',
        questions: [
            {
                idq: 1,
                str: 'تعداد جلسات تمرین در هفته',
                values: null
            },
            {
                idq: 2,
                str: 'تعداد مسابقات در هفته',
                values: null
            },
            {
                idq: 3,
                str: 'تعداد دقایق تمرین در هفته',
                values: null
            },
            {
                idq: 4,
                str: 'تعداد دقایق مسابقه در هفته',
                values: null
            },
            {
                idq: 5,
                str: 'تعداد شرکت کنندگان در هر جلسه تمرین در هفته',
                values: null
            },
            {
                idq: 6,
                str: 'تعداد شرکت کنندگان در هر مسابقه در هفته',
                values: null
            },
        ]
    },
    {
        id: 8,
        title: 'ارتباط آسیب با فعالیت بدنی',
        questions: [
            {
                idq: 1,
                str: 'مستقیم ازشرکت در مسابقه یا تمرین',
                values: null
            },
            {
                idq: 2,
                str: 'به طور غیر مستقیم در طول مسابقه یا تمرین (مانند لغزش ، زمین خوردن و آسیب در دهکده المپیک',
                values: null
            },
            {
                idq: 3,
                str: 'فعالیتهایی که اصلاً به مشارکت در ورزش مربوط نمی شود',
                values: null
            },
        ]
    },
    {
        id: 9,
        title: 'آسیبهای متعدد/چندگانه- گزارش اسیب نسبت به همه ورزشکاران، نسبت به ورزشکاران آسیب دیده، نسبت به' +
            ' آسیبهای گزارش شده',
        questions: [
            {
                idq: 1,
                str: 'تعداد اسیب',
                values: null
            },
            {
                idq: 2,
                str: 'تعداد ورزشکاران اسیب دیده',
                values: null
            },
            {
                idq: 3,
                str: 'اسیب جدید',
                values: null
            },
            {
                idq: 4,
                str: 'اسیب متعاقب',
                values: null
            },
            {
                idq: 5,
                str: 'اسیب مجدد',
                values: null
            },
            {
                idq: 6,
                str: 'عود و بدتر شدن',
                values: null
            },
            {
                idq: 7,
                str: 'تعداد روزهای time loss',
                values: null
            },
        ]
    },
    {
        id: 10,
        title: 'سیستمهای طبقه بندی اسیب های ورزشی(کد تشخیص)',
        questions: [
            {
                idq: 1,
                str: 'ICD',
                values: null
            },
            {
                idq: 2,
                str: 'OSICS',
                values: null
            },
            {
                idq: 3,
                str: 'SMDCS',
                values: null
            },
            {
                idq: 4,
                str: 'ICECI',
                values: null
            },
            {
                idq: 5,
                str: 'ICECI',
                values: null
            },
            {
                idq: 6,
                str: 'هر سه',
                values: null
            },
        ]
    }
]

export default DataTableValues;