interface questions {
    idq?: number;
    str?: string;
    values?: string[];
}

interface DataTableInterface {
    id?: number;
    title?: string;
    'questions'?: questions[];
}

const DataTableValues: DataTableInterface[] = [
    {
        'id': 1,
        'title': 'اطلاعات مدیریتی',
        'questions': [
            {
                idq: 1,
                str: 'چه کسی اطلاعات را ثبت می کند',
                'values': [
                    'پزشک ',
                    'فیزیوتراپ',
                    'مربی',
                    'اسیب شناس ورزشی'
                ]
            },
            {
                idq: 2,
                str: 'منبع  ثبت اسیب',
                'values': [
                    'بیمارستان - سرپایی (شامل بخش اورژانس و بیماران سرپایی) ',
                    'بیمارستان - سابقه بستری',
                    'سابقه کلینیک پزشکی ورزشی',
                    'سایر سوابق کلینیک سلامت (به عنوان مثال پزشک عمومی)',
                    'سوابق شرکت بیمه',
                    'سوابق خدمات پوشش پزشکی رویدادهای ورزشی',
                    'سوابق مدرسه',
                    'سوابق باشگاه یا سازمان ورزشی',
                    'سوابق امکانات ورزشی و/یا تفریحی',
                    'ثبت سوابق آموزش عالی',
                    'سوابق دیگر(مشخص کنید)',
                    'ناشناخته',
                    'تاریخ آسیب (روز/ماه/سال)',
                    'زمان آسیب(در 24 ساعت ساعت/دقیقه، صبح/عصر)',
                    'تاریخ ثبت آسیب',
                    'اطلاعات بیمه ورزشی',
                    'روز عادی یا تعطیل رسمی'
                ]
            }
        ]
    },
    {
        'id': 2,
        'title': 'داده های دموگرافیک',
        'questions': [
            {
                idq: 1,
                str: 'داده ها',
                'values': [
                    'شماره ثبت ',
                    'کد ملی',
                    'سن',
                    'قد',
                    'وزن',
                    'جنس',
                    'استان محل سکونت',
                    'شهر محل سکونت',
                    'سطح رقابت/تمرین(نخبه، آماتور، ورزشکاان تفریحی)،',
                    'نوع ناتوانی/نقص(پاراالمپیک)،',
                    'اطلاعات تماس(شماره تلفن، شماره تلفن جایگزین)،',
                    'وضعیت تاهل',
                    'تحصیلات',
                    'سال تحصیلی',
                    'ملیت',
                    'شهروند',
                    'اطلاعات پستی محل سکونت',
                    'شماره پرونده بیمارستانی',
                    'تاریخ تولد'
                ]
            },
        ]
    },
    {
        'id': 3,
        'title': 'مکان آسیب',
        'questions': [
            {
                idq: 1,
                str: 'نام مکان اسیب(متن)',
                'values': null
            },
            {
                idq: 2,
                str: 'نام مکان اسیب (نوع)',
                'values': [
                    'خانه (شامل خانه مزرعه)',
                    'موسسه اقامتی (به استثنای بیمارستان)',
                    'مدرسه، شامل مرکز مراقبت روزانه از کودکان)',
                    'بیمارستان یا سایر خدمات بهداشتی',
                    'مراکز تفریحی / تناسب اندام (مکانی عمدتاً برای فعالیت های تفریحی غیررسمی)',
                    'مراکز ورزشی( رسمی)',
                    'خیابان یا بزرگراه (جاده عمومی)',
                    'مرکزتجاری یا خدماتی',
                    'منطقه صنعتی یا ساختمانی',
                    'معدن یا شکار',
                    'مزرعه (به استثنای خانه مزرعه)',
                    'سایر مکان های مشخص شده (شامل جنگل، ساحل، ساختمان متروکه)',
                    'مکان نامشخص'
                ]
            },
            {
                idq: 3,
                str: 'مکانهای ورزشی تفریحی معین(کورت)',
                'values': [
                    'تنیس',
                    'بسکتبال',
                    'نت بال',
                    'اسکواش',
                    'والیبال',
                    'کورت برای سایر ورزشها'
                ]
            },
            {
                idq: 4,
                str: 'زمین بازی(میدان)',
                values: [
                    'فوتبال استرالیا',
                    'فوتبال',
                    'لیگ راگبی',
                    'اتحادیه راگبی',
                    'کریکت',
                    'هاکی',
                    'بیس بال',
                    'سافت بال',
                    'میدان برای ورزش های دیگر'
                ]
            },
            {
                idq: 5,
                str: 'محل برگزاری دو و میدانی',
                values: null
            },
            {
                idq: 6,
                str: 'محل برگزاری ورزش رزمی',
                values: [
                    'محل برگزاری بوکس',
                    'سایر مکان های ورزشی رزمی'
                ]
            },
            {
                idq: 7,
                str: 'پیست مسابقه',
                values: [
                    'پیست دوچرخه سواری',
                    ' پیست موتورسواری',
                    'پیست اسب دوانی',
                    'سایر مسیر مسابقه',
                ]
            },
            {
                idq: 8,
                str: 'محدوده هدف',
                values: [
                    'تیراندازی (انواع سلاح گرم)',
                    'تیراندازی با کمان',
                    'محدوده هدف دیگر'
                ]
            },
            {
                idq: 9,
                str: 'سایر مکان های ورزشی تخصصی',
                values: [
                    'زمین گلف',
                    'محل برگزاری بولینگ',
                    'محل صعود',
                    'سایر مکان های ورزشی تخصصی'
                ]
            },
            {
                idq: 10,
                str: 'استخر شنا و مجموعه های ابی',
                values: null
            },
            {
                idq: 11,
                str: 'باشگاه یا مرکز تناسب اندام',
                values: null
            },
            {
                idq: 12,
                str: 'زمین ورزشی (چند منظوره یا نامشخص)',
                values: null
            },
            {
                idq: 13,
                str: 'ورزشگاه',
                values: null
            },
            {
                idq: 14,
                str: 'پیست روی یخ',
                values: null
            },
            {
                idq: 15,
                str: 'منطقه ورزشی برفی',
                values: null
            },
            {
                idq: 16,
                str: 'فضاهای اسکیت سواری',
                values: null
            },
            {
                idq: 17,
                str: 'محل رقص',
                values: null
            },
            {
                idq: 18,
                str: 'بیلیارد، محل برگزاری اسنوکر',
                values: null
            },
            {
                idq: 19,
                str: 'سایر امکانات ورزشی چند منظوره',
                values: null
            },
            {
                idq: 20,
                str: 'مکان دیگر',
                values: null
            },
            {
                idq: 21,
                str: 'مکان نامشخص',
                values: null
            },
            {
                idq: 22,
                str: 'مکان سرپوشیده یا بیرونی',
                values: [
                    'سرپوشیده',
                    'فضای باز',
                    'دیگر',
                    'ناشناخته'
                ]
            },
            {
                idq: 23,
                str: 'متعلق به، یا مدیریت شده توسط',
                values: [
                    'شورای محلی',
                    'دولت ایالتی',
                    'دولت فدرال',
                    'خصوصی',
                    'دیگر',
                    'ناشناخته'
                ]
            },
            {
                idq: 24,
                str: 'بخش خاصی از مکان اسیب(لوکیشن میدان در ورزش تیمی)',
                values: [
                    'در محدوده منطقه مشارکت/زمین بازی',
                    'اطراف، از جمله منطقه تماشاگران، پارکینگ، منطقه مقامات',
                    'جعبه دروازه تا خط وسط دفاع',
                    'جعبه دروازه تا خط وسط حمله',
                    'جعبه دروازه حمله',
                    'محوطه جریمه حمله',
                    'نیمه اول زمین',
                    'نیمه دوم زمین',
                    'کنار دروازه در حال دفاع',
                    'کنار دروازه در حال حمله',
                    'منطقه گرم کردن',
                    'رختکن، دوش',
                    'در حین حمل و نقل به رویداد یا فعالیت',
                    'خارج زمین',
                    'سایر',
                    'نامشخص'
                ]
            },
        ]
    },
    {
        id: 4,
        title: 'دسته بندی حالت شروع آسیب',
        questions: [
            {
                idq: 1,
                str: 'حاد',
                values: null
            },
            {
                idq: 2,
                str: 'تکراری و بطور ناگهانی',
                values: null
            },
            {
                idq: 3,
                str: 'تکراری وبطور تدریجی',
                values: null
            },
            {
                idq: 4,
                str: 'ترکیب حاد و مزمن',
                values: null
            },
        ]
    },
    {
        id: 5,
        title: 'دسته بندی مکانیسم اسیب',
        questions: [
            {
                idq: 1,
                str: 'برخورد مستقیم',
                values: null
            },
            {
                idq: 2,
                str: 'برخورد غیر مستقیم',
                values: null
            },
            {
                idq: 3,
                str: 'غیربرخوردی',
                values: null
            },
        ]
    },
    {
        id: 6,
        title: 'شدت اسیب',
        questions: [
            {
                idq: 1,
                str: 'بر اساس TIME LOSS',
                values: [
                    'کم: صفر روز',
                    'ملایم: 4-7 روز',
                    'متوسط: 8-28 روز',
                    'شدید: بیشتر از 28 روز'
                ]
            },
            {
                idq: 2,
                str: 'آسیب منجر به بازنشستگی فرد از ورزش',
                values: null
            },
            {
                idq: 3,
                str: 'اسیب مرگبار در تمرین یا مسابقه',
                values: null
            },
            {
                idq: 4,
                str: 'اسیب فاجعه بار',
                values: [
                    'اسیب مغزی در اثر تروما',
                    'اسیب ستون فقرات',
                    'اسیب غیر جسمی تهدیدکننده زندگی مثل ایست قلبی'
                ]
            },
            {
                idq: 5,
                str: 'از طریق سنجش فاکتورهای امادگی جسمانی مثل قدرت، تعادل',
                values: null
            },
            {
                idq: 6,
                str: 'استفاده از شاخص شدت ورزش SSI))',
                values: null
            },
            {
                idq: 7,
                str: 'با استفاده از مقیاس آسیب مختصرAIS))',
                values: null
            },
            {
                idq: 8,
                str: 'بر اساس نوع اسیب',
                values: [
                    'رگ به رگ شدن ها، کشیدگیها، کوفتگی ها و زخم ها به آسیب های خفیف',
                    'دررفتگی ها، شکستگی ها یا ضربه های مغزی آسیب های شدید'
                ]
            },
        ]
    },
    {
        id: 7,
        title: 'گزارش ورزشکار در معرض اسیب (نوع در معرض)',
        questions: [
            {
                idq: 1,
                str: 'تعداد جلسات تمرین در هفته',
                values: null
            },
            {
                idq: 2,
                str: 'تعداد مسابقات در هفته',
                values: null
            },
            {
                idq: 3,
                str: 'تعداد دقایق تمرین در هفته',
                values: null
            },
            {
                idq: 4,
                str: 'تعداد دقایق مسابقه در هفته',
                values: null
            },
            {
                idq: 5,
                str: 'تعداد شرکت کنندگان در هر جلسه تمرین در هفته',
                values: null
            },
            {
                idq: 6,
                str: 'تعداد شرکت کنندگان در هر مسابقه در هفته',
                values: null
            },
        ]
    },
    {
        id: 8,
        title: 'ارتباط آسیب با فعالیت بدنی',
        questions: [
            {
                idq: 1,
                str: 'مستقیم ازشرکت در مسابقه یا تمرین',
                values: null
            },
            {
                idq: 2,
                str: 'به طور غیر مستقیم در طول مسابقه یا تمرین (مانند لغزش ، زمین خوردن و آسیب در دهکده المپیک',
                values: null
            },
            {
                idq: 3,
                str: 'فعالیتهایی که اصلاً به مشارکت در ورزش مربوط نمی شود',
                values: null
            },
        ]
    },
    {
        id: 9,
        title: 'آسیبهای متعدد/چندگانه- گزارش اسیب نسبت به همه ورزشکاران، نسبت به ورزشکاران آسیب دیده، نسبت به' +
            ' آسیبهای گزارش شده',
        questions: [
            {
                idq: 1,
                str: 'تعداد اسیب',
                values: null
            },
            {
                idq: 2,
                str: 'تعداد ورزشکاران اسیب دیده',
                values: null
            },
            {
                idq: 3,
                str: 'اسیب جدید',
                values: null
            },
            {
                idq: 4,
                str: 'اسیب متعاقب',
                values: null
            },
            {
                idq: 5,
                str: 'اسیب مجدد',
                values: null
            },
            {
                idq: 6,
                str: 'عود و بدتر شدن',
                values: null
            },
            {
                idq: 7,
                str: 'تعداد روزهای time loss',
                values: null
            },
        ]
    },
    {
        id: 10,
        title: 'سیستمهای طبقه بندی اسیب های ورزشی(کد تشخیص)',
        questions: [
            {
                idq: 1,
                str: 'ICD',
                values: null
            },
            {
                idq: 2,
                str: 'OSICS',
                values: null
            },
            {
                idq: 3,
                str: 'SMDCS',
                values: null
            },
            {
                idq: 4,
                str: 'ICECI',
                values: null
            },
            {
                idq: 5,
                str: 'ASIDD',
                values: null
            },
        ]
    },
    {
        id: 11,
        title: 'گزارش اسیب بر اساس شیوع وبروز و بار اسیب',
        questions: [
            {
                idq: 1,
                str: 'بروز و شیوع و بار اسیب  بازای 1000 ساعت در معرض',
                values: null
            },
            {
                idq: 2,
                str: 'بازای 1000 ورزشکار در معرض',
                values: null
            },
            {
                idq: 3,
                str: 'بازای 1000 جلسه تمرین',
                values: null
            },
            {
                idq: 4,
                str: 'بازای 1000 جلسه مسابقه',
                values: null
            },

        ]
    },
    {
        id: 12,
        title: 'نوع فعالیت موقع اسیب – حوزه های گوناگون',
        questions: [
            {
                idq: 1,
                str: 'کار در ازای پول',
                values: null
            },
            {
                idq: 2,
                str: 'کار بدون مزد',
                values: null
            },
            {
                idq: 3,
                str: 'حمل و نقل(با هر وسیله نقلیه یا عابر پیاده از مکانی به مکان دیگر برود)',
                values: null
            },
            {
                idq: 4,
                str: 'ورزش سازمان یافته',
                values: null
            },
            {
                idq: 5,
                str: '  ورزش سازماندهی نشده',
                values: null
            },
            {
                idq: 6,
                str: 'اوقات فراغت',
                values: null
            },
            {
                idq: 7,
                str: '  مراقبت های بهداشتی',
                values: null
            },
            {
                idq: 8,
                str: 'فعالیت هی حیاتی(خوابیدن، غذاخوردن، لباس پوشیدن)',
                values: null
            },
            {
                idq: 9,
                str: ' هیچگونه فعالیت خاصی',
                values: null
            },
            {
                idq: 10,
                str: 'سایر فعالیتهای مشخص',
                values: null
            },
            {
                idq: 11,
                str: 'فعالیت نامشخص',
                values: null
            },
        ]
    },
    {
        id: 13,
        title: 'نوع فعالیت ورزشی/تمرین: مروری بر کدها',
        questions: [
            {
                idq: 1,
                str: 'ورزش های تیمی با توپ',
                values: null
            },
            {
                idq: 2,
                str: 'ورزشهای تیمی چوب و توپ',
                values: null
            },
            {
                idq: 3,
                str: 'ورزش های آبی تیمی',
                values: null
            },
            {
                idq: 4,
                str: 'ورزش قایقرانی',
                values: null
            },
            {
                idq: 5,
                str: 'ورزش های آبی انفرادی',
                values: null
            },
            {
                idq: 6,
                str: 'ورزش یخ یا برف',
                values: null
            },
            {
                idq: 7,
                str: 'فعالیت های ورزشی انفرادی',
                values: null
            },
            {
                idq: 8,
                str: 'ورزش آکروباتیک',
                values: null
            },
            {
                idq: 9,
                str: 'فعالیت های زیبایی شناختی',
                values: null
            },
            {
                idq: 10,
                str: 'ورزش راکتی',
                values: null
            },
            {
                idq: 11,
                str: 'ورزش هدف/دقت',
                values: null
            },
            {
                idq: 12,
                str: 'ورزش رزمی',
                values: null
            },
            {
                idq: 13,
                str: 'ورزش های قدرتی',
                values: null
            },
            {
                idq: 14,
                str: 'فعالیت سوارکاری',
                values: null
            },
            {
                idq: 15,
                str: 'ورزش ماجراجویی',
                values: null
            },
            {
                idq: 16,
                str: 'ورزش های موتوری چرخ دار',
                values: null
            },
            {
                idq: 17,
                str: 'ورزش غیر موتوری چرخ دار',
                values: null
            },
            {
                idq: 18,
                str: 'ورزش چند رشته ای',
                values: null
            },
            {
                idq: 19,
                str: 'ورزش هوازی (غیر موتوری).',
                values: null
            },
            {
                idq: 20,
                str: 'سایر فعالیت های تفریحی مرتبط با مدرسه',
                values: null
            },
            {
                idq: 21,
                str: 'سایر فعالیت های ورزشی/ورزشی مشخص شده',
                values: null
            },
            {
                idq: 22,
                str: 'فعالیت ورزشی/ورزشی نامشخص',
                values: null
            },


        ]
    },
    {
        id: 14,
        title: 'مرحله فعالیت',
        questions: [
            {
                idq: 1,
                str: 'آموزش/ تمرین' +
                    'اسیب ها رخ می دهند در تمرین برای یک فعالیت رقابتی',
                values: [
                    'تمرینات ویژه ورزشی یا تمرین ویژه مهارت(شامل تمرینات دویدن)',
                    'تمرین ورزش بصورت بازی در مقابل دیگران ولی نه در رقابت',
                    'تمرینات اماده  ساز ی قدرتی با وزنه ' +
                    'شامل تمرینات : با وزنه، دراز و نشست، شنا یا پوش اپ، ' +
                    'بجز: تمرینات قلبی عروقی و هوازی',
                    'تمرینات قلبی عروقی' +
                    'شامل: ایروبیک، جاگینگ، دوچرخه ثابت',
                    'سایر تمرینات مشخص شده',
                    'آموزش/تمرین نامشخص',
                ]
            },
            {
                idq: 2,
                str: 'قبل از رویداد: هر فعالیتی که پس از انتقال به یک رویداد اما قبل از گرم کردن رخ می دهد.' +
                    'شامل: لباس پوشیدن، تیپینگ، دوش گرفتن',
                values: null
            },
            {
                idq: 3,
                str: ' کردن: هر گونه فعالیت بدنی که برای گرم کردن عضلات بلافاصله قبل از مسابقه یا شرکت انجام می شود:' +
                    'شامل: تمرینات کششی، جاگینگ، تمرین ان ورزش با دیگران بصورت سبک',
                values: null
            },
            {
                idq: 4,
                str: 'رقابت/مشارکت' +
                    'اگر رویدادی شروع و پایان برنامه ریزی شده ای داشته باشد',
                values: [
                    '25٪ اول از مدت زمان مورد انتظار رویداد' +
                    'شامل: کوارتر اول یک بازی فوتبال' +
                    '100 متر اول یک مسابقه 400 متری',
                    'میانه 50٪ از مدت زمان مورد انتظار رویداد' +
                    'شامل می شود:' +
                    'کوارتر دوم یا سوم یک بازی فوتبال' +
                    '100 متر دوم یا سوم مسابقه 400 متر',
                    '25٪ اخر از مدت زمان مورد انتظار رویداد' +
                    'شامل می شود:' +
                    '•کوارتر چهارم یک بازی فوتبال' +
                    '100 متر آخر یک مسابقه 400 متری',
                    'سایر (برای رویدادهایی که نمی توان دوره زمانی آنها را پیش بینی کرد)',
                    'مرحله نامشخص رویداد',
                ]
            },
            {
                idq: 5,
                str: '  سرد کردن: هر گونه فعالیت بدنی که برای خنک کردن عضلات بلافاصله پس از شرکت یا مسابقه انجام می شود',
                values: null
            },
            {
                idq: 6,
                str: 'پس از رویداد: هر فعالیتی که پس از خنک شدن اما قبل از انتقال به دور از رویداد رخ می دهد' +
                    'شامل :' +
                    ' دوش گرفتن، لباس پوشیدن',
                values: null
            },
            {
                idq: 7,
                str: ' مشارکت تفریحی: برای آسیب‌هایی که در طول فعالیت‌ها رخ می‌دهد بدون اینکه مرز مشخصی بین آموزش/تمرین (1) و مسابقه/شرکت وجود داشته باشد. ' +
                    'شامل: دویدن، پیاده روی، دوچرخه سواری غیررقابتی',
                values: null
            },
            {
                idq: 8,
                str: 'مرحله یا فعالیت مشخص دیگر',
                values: null
            },
            {
                idq: 9,
                str: ' مرحله یا فعالیت نامشخص',
                values: null
            },

        ]
    },
    {
        id: 15,
        title: 'چه کسی  داده ها را جمع اوری می کند',
        questions: [
            {
                idq: 1,
                str: 'پزشک',
                values: null
            },
            {
                idq: 2,
                str: 'فیزیوتراپ',
                values: null
            },
            {
                idq: 3,
                str: 'مربی',
                values: null
            },
            {
                idq: 4,
                str: 'ورزشکار',
                values: null
            },
            {
                idq: 5,
                str: 'داوطلب غیر بالینی',
                values: null
            },


        ]
    },
    {
        id: 16,
        title: 'اسیب در چه زمانی از فصل مسابقات رخ داده است؟',
        questions: [
            {
                idq: 1,
                str: 'قبل فصل',
                values: null
            },
            {
                idq: 2,
                str: 'حین فصل',
                values: null
            },
            {
                idq: 3,
                str: 'بعد فصل',
                values: null
            },


        ]
    },
    {
        id: 17,
        title: 'منبع/منابع استفاده داده',
        questions: [
            {
                idq: 1,
                str: 'گزارش خود ورزشکار',
                values: null
            },
            {
                idq: 2,
                str: 'پرونده پزشکی',
                values: null
            },
            {
                idq: 3,
                str: 'معاینات',
                values: null
            },
            {
                idq: 4,
                str: 'ضبط ویدئو',
                values: null
            },


        ]
    },
    {
        id: 18,
        title: 'فراوانی گزارش دهی و جمع اوری داده',
        questions: [
            {
                idq: 1,
                str: 'روزانه',
                values: null
            },
            {
                idq: 2,
                str: 'هفتگی',
                values: null
            },
            {
                idq: 3,
                str: 'ماهانه',
                values: null
            },



        ]
    },
    {
        id: 19,
        title: 'مدت نظارت',
        questions: [
            {
                idq: 1,
                str: 'مسابقات',
                values: null
            },
            {
                idq: 2,
                str: 'فصل ',
                values: null
            },
            {
                idq: 3,
                str: 'کل سال',
                values: null
            },



        ]
    },
    {
        id: 20,
        title: 'فاکتورهای اسیب: انواع اشیا، مواد و عوامل محیطی دخیل در بروز آسیب.',
        questions: [
            {
                idq: 1,
                str: 'تجهیزات ورزشی',
                values: [
                    'توپ',
                    'پرتابه های ورزشی دیگر مانند پرتاب نیزه، پوک، دیسک',
                    'چوب بیسبال، راکت، چوب هاکی و غیره',
                    'تجهیزات میدانی مانند تیرک دروازه، تیرک گوشه، پایه،',
                    'تجهیزات اطراف مانند فنس، علائم، صندلی تماشاچی، ',
                    'سایر اشیا دور یا روی زمین بازی',
                    'تجهیزات ورزشی دیگر یا نامشخص',

                ]
            },
            {
                idq: 2,
                str: 'اشیا طبیعی یا حیوانی',
                values: [
                    'درخت (شامل شاخه، چوب)',
                    'گیاه (به استثنای درخت',
                    'عوامل اقلیمی (مانند باد، باران، برف، آفتاب)',
                    'سطح طبیعی (شامل بی نظمی مانند چاله)',
                    'سگ',
                    'اسب',
                    'شی طبیعی یا حیوان نامشخص دیگر',

                ]
            },
            {
                idq: 3,
                str: 'غذا، نوشیدنی، مورد استفاده شخصی',
                values: [
                    'الکل (نوشیدنی)',
                    'کفش (شامل کفش ورزشی یا صنعتی یا چکمه)',

                ]
            },
            {
                idq: 4,
                str: 'ساختار یا اتصالات',
                values: [
                    'کف - چوبی',
                    'کف - بتن',
                    'کف - سطح مصنوعی (چمن، تشک لاستیکی)',
                    'سطوح زمین سخت - تنیس و غیره',

                ]
            },
            {
                idq: 5,
                str: 'محیط بازی در فضای باز',
                values: [
                    'سطح - چمن (ناهموار، چمن بلند، چاله دار)',
                    'سطح - شن و ماسه (فشرده، مرطوب، ناهموار)',
                    'قیر، بتن (وضعیت نامناسب، سوراخ، سنگ های سست)',
                    'خاک رس، خاک فشرده و غیره',

                ]
            },
            {
                idq: 6,
                str: 'متفرقه',
                values: [
                    'سوزن زیرجلدی، سرنگ',


                ]
            },
            {
                idq: 7,
                str: 'عوامل محیطی',
                values: [
                    'گرما: خورشیدی، رطوبت',
                    'سرما: برف، کولاک، یخ',
                    'شرایط زمین مرطوب و لغزنده',
                    'شرایط زمین سخت و فشرده',
                    'باد، طوفان',
                    'رعد و برق',
                ]
            },


        ]
    },
    {
        id: 21,
        title: 'اقدامات متقابل شخصی برای محافظت از اسیب',
        questions: [
            {
                idq: 1,
                str: 'از وسایل حفاظتی استفاده نشده است',
                values: null
            },
            {
                idq: 2,
                str: 'بریس، محافظ، ارتز' +
                    'شامل: بریس و محافظ زانو، مچ پا و ساق پا',
                values: null
            },
            {
                idq: 3,
                str: 'تیپینگ محکم مفصل',
                values: null
            },
            {
                idq: 4,
                str: 'بالشتک مفصل، برجستگی استخوانی یا ماهیچه',
                values: null
            },
            {
                idq: 5,
                str: 'لباسهای پوشیدنی گرمازا مثل ترموسکین و لباس گرم مخصوص غواصی',
                values: null
            },
            {
                idq: 6,
                str: 'لباسهای پوشیدنی گرمازا مثل ترموسکین و لباس گرم مخصوص غواصی',
                values: null
            },
            {
                idq: 7,
                str: 'دستکش',
                values: null
            },
            {
                idq: 8,
                str: 'محافظ دهان',
                values: null
            },
            {
                idq: 9,
                str: 'عینک محافظ',
                values: null
            },
            {
                idq: 10,
                str: 'کلاه ایمنی',
                values: null
            },
            {
                idq: 11,
                str: 'ماسک محافظ صورت / شیلد',
                values: null
            },
            {
                idq: 12,
                str: 'پوشش پا: کفش/چکمه های پنجه سخت',
                values: null
            },
            {
                idq: 13,
                str: 'وسیله شناور شخصی/ تخته شنا',
                values: null
            },
            {
                idq: 14,
                str: 'سایر اقدامات متقابل شخصی مشخص شده',
                values: null
            },
            {
                idq: 15,
                str: 'اقدام متقابل شخصی نامشخص',
                values: null
            },



        ]
    },
    {
        id: 22,
        title: 'اقدامات متقابل زیست محیطی برای محافظت از اسیب',
        questions: [
            {
                idq: 1,
                str: 'از وسایل حفاظتی استفاده نشده است',
                values: null
            },
            {
                idq: 2,
                str: 'بالشتک محافظ روی سطح مسابقه' +
                    'شامل می شود:' +
                    'تشک چاله پرش ارتفاع' +
                    'تشک جودو',
                values: null
            },
            {
                idq: 3,
                str: 'محافظ تیرک های دروازه، نشانگرهای کرنر',
                values: null
            },
            {
                idq: 4,
                str: 'حائل بین منطقه فعالیت و تماشاگران/ محیط',
                values: null
            },
            {
                idq: 5,
                str: 'مهارهای ایمنی / مهارهای وسیله نقلیه' +
                    'مثل: طناب، کمربند ایمنی',
                values: null
            },
            {
                idq: 6,
                str: 'سایر اقدامات متقابل زیست محیطی مشخص شده',
                values: null
            },
            {
                idq: 7,
                str: 'اقدام متقابل زیست محیطی نامشخص',
                values: null
            },



        ]
    },
    {
        id: 23,
        title: 'قصد و نیت: نقش هدف انسان در رویداد آسیب',
        questions: [
            {
                idq: 1,
                str: 'غیر عمد',
                values: null
            },
            {
                idq: 2,
                str: 'خودآزاری عمدی( خودکشی، خودکشی ناموفق)خودزنی',
                values: null
            },
            {
                idq: 3,
                str: 'تجاوز',
                values: null
            },
            {
                idq: 4,
                str: 'خشونت دیگر ' +
                    'جراحت وارده توسط مامور مجری قانون در جریان اقدامات قانونی' +
                    '-صدمات وارد شده توسط سازمان دولتی در طول تلاش برای اجرای قانون' +
                    '-اعدام یا جراحت به دستور قوه قضاییه یا مقام حاکم',
                values: null
            },
            {
                idq: 5,
                str: 'قصد مشخص' ,
                values: null
            },
            {
                idq: 6,
                str: 'عوارض مراقبت های پزشکی یا جراحی',
                values: null
            },
            {
                idq: 7,
                str: 'سایر اهداف مشخص شده مثل اتانازی',
                values: null
            },
            {
                idq: 8,
                str: 'قصد نامشخص' +
                    'شامل می شود:' +
                    'جراحت ناشی از حادثه ناشناخته',
                values: null
            },



        ]
    },
    {
        id: 24,
        title: 'مکانیسم اسیب: روشی که در آن جراحت وارد شده است (یعنی چگونه فرد آسیب دیده است).',
        questions: [
            {
                idq: 1,
                str: 'افتادن',
                values: [
                    'سقوط یا زمین خوردن در همان سطح',
                    'سقوط، لغزش یا زمین خوردن در همان سطح/ناهموار',
                    'افتادن از پله ها',
                    'سقوط/پرش/فرود ناشیانه از ارتفاع کمتر (<1 متر)',
                    'سقوط/پرش/فرود ناشیانه از ارتفاع بیشتر (=> 1 متر)',
                    'افتادن مشخص دیگر',
                    'نامشخص',
                ]
            },
            {
                idq: 2,
                str: 'ضربه یا تصادف با اشیا، انسان یا حیوان',
                values: [
                    'تماس با جسم متحرک (دوچرخه، نیزه، راکت، توپ، چوب بازی و ...)',
                    'تماس با جسم ساکن (حصار، تجهیزات، پست ها و ...)',
                    'تماس با شخص (داور، بازیکن، تماشاگر)',
                    'نفر متحرک',
                    'نفر ثابت',
                    'نفر، ناشناخته در حال حرکت',
                    'تماس با حیوانات (اسب، گاو)',
                    'مخاطب مشخص دیگر',
                    'تماس نامشخص',

                ]
            },
            {
                idq: 3,
                str: 'خرد کردن، سوراخ کردن، سایش',
                values: [
                    'نیشگون گرفتن، خرد کردن',
                    'بریدن، پاره شدن',
                    'سوراخ',
                    'نیش / نیش توسط حیوان / انسان / حشره',
                    'سایش، مالش، اصطکاک (مثلاً پا درون چکمه، سر خوردن روی زمین)',
                    'خرد کردن / سوراخ کردن مشخص شده دیگر',
                    'خرد کردن/ سوراخ کردن نامشخص'
                ]
            },
            {
                idq: 4,
                str: 'خفگی',
                values: [
                    'خفه کردن',
                    'انسداد راه های هوایی',
                    'غرق شدن و نزدیک به غرق شدن',
                    'فشرده سازی قفسه سینه',
                    'خفگی ناشی از دود یا کاهش اکسیژن',
                    'خفگی مشخص دیگر',
                    'خفگی نامشخص',

                ]
            },
            {
                idq: 5,
                str: 'اثر شیمیایی' ,
                values: [
                    'خوردگی توسط مواد جامد مثل زنگ زدگی',
                    'خوردگی توسط مواد مایع',
                    'خوردگی توسط مواد گازی',
                    'خوردگی نامشخص',
                    'مسمومیت با مواد جامد',
                    'مسمومیت با مواد مایع',
                    'مسمومیت با مواد گازی',
                    'مسمومیت نامشخص',
                    'اثر شیمیایی دیگر',
                    'اثر شیمیایی نامشخص',
                ]
            },
            {
                idq: 6,
                str: 'اثر حرارتی',
                values: [
                    'مایع داغ بخار',
                    'جسم داغ',
                    'آتش باز، شعله های آتش',
                    'گرم کردن کل بدن (به عنوان مثال هایپرترمی)',
                    'سرد شدن قسمتی از بدن (مانند سرمازدگی)',
                    'سرد شدن کل بدن(هیپوترمی)',
                    'خنک کننده تماسی',
                    'سردی نامشخص',
                    'اثر حرارتی مشخص دیگر',
                    'اثر حرارتی نامشخص',
                ]
            },
            {
                idq: 7,
                str: 'الکتریکی، اثر تشعشعی',
                values: [
                    'جریان برق',
                    'نور جوشکاری',
                    'نور خورشید',
                    'دیگر اثر الکتریکی/تابش مشخص شده',
                    'اثر الکتریکی/تابشی نامشخص',

                ]
            },
            {
                idq: 8,
                str: 'فشار بیش از حد تدریجی یا مزمن بدن یا بخشی از بدن',
                values: [
                    'ضربه های مکرر، استفاده بیش از حد',
                    'فعالیت بیش از حد تدریجی یا مزمن نامشخص',

                ]
            },
            {
                idq: 9,
                str: 'اعمال بیش از حد حاد بدن یا بخشی از بدن',
                values: [
                    'تغییر ناگهانی یا سریع سرعت (شامل شتاب گیری، کاهش سرعت با تلاش خود)',
                    'تغییر جهت ناگهانی یا سریع (شامل چرخش، پیچش)',
                    'اعمال بیش از حد حاد نامشخص قسمت یا بخشی از بدن',

                ]
            },
            {
                idq: 10,
                str: 'مکانیسم اسیب  نامشخص دیگر',
                values: [
                    'انرژی آکوستیک، صدای بلند',
                    'مکانیسم آسیب مشخص دیگر ',
                    'مکانیسم اسیب نامشخص دیگر',

                ]
            },


        ]
    },
    {
        id: 25,
        title: 'شرح مکانیسم اسیب: نحوه وقوع جراحت را دقیقاً شرح دهید',
        questions:[
            {
                idq: 1,
                str: 'شرح مکانیسم اسیب: نحوه وقوع جراحت را دقیقاً شرح دهید',
                values: null
            },
        ]

    },
    {
        id: 26,
        title: 'تشخیص اولیه: تشخیص در زمان ثبت آسیب. متن آزاد برای تشریح یا دادن تشخیص خاص برای آسیب استفاده می شود',
        questions:[
            {
                idq: 1,
                str: 'تشخیص اولیه: تشخیص در زمان ثبت آسیب. متن آزاد برای تشریح یا دادن تشخیص خاص برای آسیب استفاده می شود',
                values: null
            },
        ]
    },
    {
        id: 27,
        title: 'فاکتورهای درمان: ',
        questions: [
            {
                idq: 1,
                str: 'تاریخ درمان اسیب بصورت: DD/MM/YYYY',
                values: null
            },
            {
                idq: 2,
                str: 'زمان ارایه درمان: زمانی که فرد آسیب دیده تحت درمان یا ارزیابی آسیب خود قرار گرفته است باید با استفاده از ساعت 24 ساعته ثبت شود.',
                values: null
            },
            {
                idq: 3,
                str: 'دلیل معرفی:',
                values: [
                    'مصدومیت جدید',
                    'آسیب مکرر',
                    'تشدید آسیب',
                    'درمان مداوم (کلینیک یا محیط بازی)',
                    'سایر',
                    'ناشناخته',
                ]
            },




        ]
    },
    {
        id: 28,
        title: 'درمان: نوع درمان ارائه شده در رویداد آسیب اولیه یا به عنوان مدیریت مداوم آسیب ',
        questions: [
            {
                idq: 1,
                str: 'هیچ موردی نیاز نیست',
                values: null
            },
            {
                idq: 2,
                str: 'هیچ درمانی، به جای دیگری ارجاع شده است',
                values: null
            },
            {
                idq: 3,
                str: 'عصا',
                values: null
            },
            {
                idq: 4,
                str: 'دارو',
                values: null
            },
            {
                idq: 5,
                str: 'RICER استراحت، یخ، فشرده سازی، ارتفاع، ارجاع',
                values: null
            },
            {
                idq: 6,
                str: 'ICE یخ، فشرده سازی، بلند کردن',
                values: null
            },
            {
                idq: 7,
                str: 'گرما',
                values: null
            },
            {
                idq: 8,
                str: 'ماساژ',
                values: null
            },
            {
                idq: 9,
                str: 'بانداژ و تیپ کاری',
                values: null
            },
            {
                idq: 10,
                str: 'درمان دستی /دستکاری',
                values: null
            },
            {
                idq: 11,
                str: 'ارزیابی پزشکی',
                values: null
            },
            {
                idq: 12,
                str: 'مدیریت زخم (مانند بخیه زدن، پانسمان)',
                values: null
            },
            {
                idq: 13,
                str: 'درمان مشترک',
                values: null
            },
            {
                idq: 14,
                str: 'مهاربندی، آتل، گچ',
                values: null
            },
            {
                idq: 15,
                str: 'بیحرکتی - به روشی غیر از 14',
                values: null
            },
            {
                idq: 16,
                str: 'جراحی',
                values: null
            },
            {
                idq: 17,
                str: 'تعویض دندان (در زمان آسیب)',
                values: null
            },
            {
                idq: 18,
                str: 'الکتروتراپی',
                values: null
            },
            {
                idq: 19,
                str: 'دیگر',
                values: null
            },
            {
                idq: 20,
                str: 'ناشناخته',
                values: null
            },




        ]
    },
    {
        id: 29,
        title: 'توصیه هایی به فرد آسیب دیده',
        questions: [
            {
                idq: 1,
                str: 'بازگشت فوری به رقابت یا فعالیت نامحدود',
                values: null
            },
            {
                idq: 2,
                str: 'قادر به بازگشت به فعالیت با محدودیت',
                values: null
            },
            {
                idq: 3,
                str: 'در حال حاضر قادر به بازگشت نیست',
                values: null
            },
            {
                idq: 4,
                str: 'سایر',
                values: null
            },

        ]
    },
    {
        id: 30,
        title: 'دلیل معرفی: ',
        questions: [
            {
                idq: 1,
                str: 'مصدومیت جدید',
                values: null
            },
            {
                idq: 2,
                str: 'آسیب مکرر',
                values: null
            },
            {
                idq: 3,
                str: 'تشدید آسیب',
                values: null
            },
            {
                idq: 4,
                str: 'درمان مداوم (کلینیک یا محیط بازی)',
                values: null
            },
            {
                idq: 5,
                str: 'سایر',
                values: null
            },
            {
                idq: 6,
                str: 'ناشناخته',
                values: null
            },


        ]
    },
    {
        id: 31,
        title: 'ارجاع: نشان می دهد که اگر مصدوم برای ارزیابی بیشتر ارجاع داده شود، به چه کسی و چگونه فوری به آنها توصیه می شود که به دنبال ارزیابی یا درمان بیشتر باشند. ',
        questions: [
            {
                idq: 1,
                str: 'چه موقع فرد باید ارجاع شود؟',
                values: [
                    'بلافاصله',
                    'در عرض یک ساعت',
                    'ظرف 1-4 ساعت آینده',
                    'در روز',
                    'روز بعد',
                    'ظرف 1-4 روز آینده',
                    'ظرف یک هفته',
                    'ظرف یکماه',

                ]
            },
            {
                idq: 2,
                str: 'مصدوم به کجا یا به چه کسی ارجاع می شود؟',
                values: [
                    'به سایر متخصصان پزشکی ورزشی (به استثنای پزشک)',
                    'پزشک (از جمله پزشک ورزش، جراح)',
                    'خدمات تشخیصی (مانند اشعه ایکس، سونوگرافی)',
                    'بخش اورژانس بیمارستان',
                    'خود (برای درمان یا ارزیابی بیشتر)',
                    'نیاز به ارجاع ندارد',
                    'سایر',
                ]
            },


        ]
    },
    {
        id: 32,
        title: 'شخص درمان کننده ',
        questions: [
            {
                idq: 1,
                str: 'کمک کننده های اولیه',
                values: null
            },
            {
                idq: 2,
                str: 'امدادگر ورزشی / مربی ورزشی',
                values: null
            },
            {
                idq: 3,
                str: 'پرستار',
                values: null
            },
            {
                idq: 4,
                str: 'فیزیوتراپیست',
                values: null
            },
            {
                idq: 5,
                str: 'متخصص پا',
                values: null
            },
            {
                idq: 6,
                str: 'ماساژ درمانگر',
                values: null
            },

            {
                idq:7,
                str: 'اسیب شناس ورزشی و حرکات اصلاحی',
                values: null
            },
            {
                idq: 8,
                str: 'پزشک/پزشک عمومی (از جمله پزشک ورزشی)',
                values: null
            },
            {
                idq: 9,
                str: 'کایروپراکتیک',
                values: null
            },
            {
                idq: 10,
                str: 'دندانپزشک/ تکنسین دندانپزشکی',
                values: null
            },
            {
                idq: 11,
                str: 'بینایی سنج / چشم پزشک',
                values: null
            },
            {
                idq: 12,
                str: 'جراح ارتوپد',
                values: null
            },
            {
                idq: 13,
                str: 'جراح دیگر',
                values: null
            },
            {
                idq: 14,
                str: 'مربی / داور',
                values: null
            },
            {
                idq: 15,
                str: 'خود',
                values: null
            },
            {
                idq: 16,
                str: 'بازیکن دیگر',
                values: null
            },
            {
                idq: 17,
                str: 'پدر و مادر',
                values: null
            },
            {
                idq: 18,
                str: 'سایر',
                values: null
            },


        ]
    },
    {
        id: 33,
        title: 'پوزیشن بازیکن ',
        questions: [
            {
                idq: 1,
                str: 'دفاع',
                values: null
            },
            {
                idq: 2,
                str: 'حمله',
                values: null
            },
            {
                idq: 3,
                str: 'هافبک',
                values: null
            },
            {
                idq: 4,
                str: 'کناره های زمین',
                values: null
            },
            {
                idq: 5,
                str: 'سانتر',
                values: null
            },
            {
                idq: 6,
                str: 'سایر',
                values: null
            },

        ]
    },
    {
        id: 34,
        title: 'درجه ضربه مغزی در صورت اسیب ',
        questions: [
            {
                idq: 1,
                str: 'ضربه مغزی درجه 1',
                values: null
            },
            {
                idq: 2,
                str: 'ضربه مغزی درجه2',
                values: null
            },
            {
                idq: 3,
                str: 'ضربه مغزی درجه3',
                values: null
            },
            {
                idq: 4,
                str: 'بدون ضربه مغزی',
                values: null
            },
            {
                idq: 5,
                str: 'نامشخص',
                values: null
            },

        ]
    },
    {
        id: 35,
        title: ' ویژگیهای اسیب (پاتولوژی) طبقه بندی مناطق بدن',
        questions: [
            {
                idq: 1,
                str: 'سر',
                values: null
            },
            {
                idq: 2,
                str: 'صورت',
                values: null
            },
            {
                idq: 3,
                str: 'گردن',
                values: null
            },
            {
                idq: 4,
                str: 'قفسه سینه',
                values: null
            },
            {
                idq: 5,
                str: 'شکم',
                values: null
            },
            {
                idq: 6,
                str: 'قسمت پایین کمر',
                values: null
            },
            {
                idq: 7,
                str: 'لگن',
                values: null
            },
            {
                idq: 8,
                str: 'شانه',
                values: null
            },
            {
                idq: 9,
                str: 'بازو',
                values: null
            },
            {
                idq: 10,
                str: 'ارنج',
                values: null
            },
            {
                idq: 11,
                str: 'ساعد',
                values: null
            },
            {
                idq: 12,
                str: 'مچ دست',
                values: null
            },
            {
                idq: 13,
                str: 'دست',
                values: null
            },
            {
                idq: 14,
                str: 'هیپ',
                values: null
            },
            {
                idq: 15,
                str: 'ران',
                values: null
            },
            {
                idq: 16,
                str: 'زانو',
                values: null
            },
            {
                idq: 17,
                str: 'ساق پا',
                values: null
            },
            {
                idq: 18,
                str: 'قوزک',
                values: null
            },
            {
                idq: 19,
                str: 'پا شامل انگشتان',
                values: null
            },
            {
                idq: 20,
                str: 'محل بدن نامشخص',
                values: null
            },
            {
                idq: 21,
                str: 'صدمات متعدد (شامل بیش از یک مکان بدنی)',
                values: null
            },
            {
                idq: 22,
                str: 'محل بدن مورد نیاز نیست',
                values: null
            },




        ]
    },
    {
        id: 36,
        title: 'ویژگیهای اسیب (پاتولوژی)سمت اسیب',
        questions: [
            {
                idq: 1,
                str: 'راست',
                values: null
            },
            {
                idq: 2,
                str: 'چپ',
                values: null
            },

        ]
    },
    {
        id: 37,
        title: 'ویژگیهای اسیب (پاتولوژی)طبقه بندی نوع اسیب شناسی ',
        questions: [
            {
                idq: 1,
                str: 'سطحی (شامل کبودی، تاول، خراشیدگی، التهاب  و تورم سطحی به استثنای آسیب سطحی چشم)',
                values: null
            },
            {
                idq: 2,
                str: 'زخم باز (به استثنای آسیب چشم)',
                values: null
            },
            {
                idq: 3,
                str: 'شکستگی (به استثنای دندان شکسته',
                values: null
            },
            {
                idq: 4,
                str: 'شکستگی استرس(استرس فراکچر)',
                values: null
            },
            {
                idq: 5,
                str: 'دررفتگی (شامل پارگی دیسک، غضروف.)',
                values: null
            },
            {
                idq: 6,
                str: 'اسپرین',
                values: null
            },
            {
                idq: 7,
                str: 'استرین',
                values: null
            },
            {
                idq: 8,
                str: 'آسیب به عصب (شامل نخاع، بدون آسیب داخل جمجمه)',
                values: null
            },
            {
                idq: 9,
                str: 'اسیب عروق خونی',
                values: null
            },
            {
                idq: 10,
                str: 'آسیب به عضله یا تاندون',
                values: null
            },
            {
                idq: 11,
                str: 'آسیب له شدن',
                values: null
            },
            {
                idq: 12,
                str: 'قطع عضو',
                values: null
            },
            {
                idq: 13,
                str: 'آسیب به اندام داخلی',
                values: null
            },
            {
                idq: 14,
                str: 'سوختگی یا فساد تدریجی',
                values: null
            },
            {
                idq: 15,
                str: 'آسیب چشم (به استثنای جسم خارجی در چشم خارجی)',
                values: null
            },
            {
                idq: 16,
                str: 'جسم خارجی',
                values: [
                    'جسم خارجی در چشم خارجی',
                    'جسم خارجی در کانال گوش',
                    'جسم خارجی در دستگاه تنفسی (به استثنای جسم خارجی در بینی',
                    'جسم خارجی در دستگاه گوارش',
                    'جسم خارجی در دستگاه تناسلی - ادراری',
                    'جسم خارجی در بافت نرم',
                    'جسم خارجی، دیگر/نامشخص',
                    'آسیب داخل جمجمه (شامل ضربه مغزی)',
                    'آسیب دندانی (شامل شکستگی دندان)',
                    'غرق شدن یا غوطه ور شدن',
                    'خفگی یا تهدید دیگری برای تنفس (به استثنای غرق شدن',
                    'جراحت برق',
                    'مسمومیت یا اثر سمی (به استثنای نیش سمی',
                    'اثر زهر; هر نیش حشره',
                    'سایر ماهیت مشخص شده آسیب',
                    'گرمازدگی',
                    'صدمه با ماهیت نامشخص',
                    'صدمات متعدد با بیش از یک «طبیعت»',
                    'هیچ آسیبی تشخیص داده نشد',

                ]

            },


        ]
    },
]

export default DataTableValues;
